/**
 * Created by NSD on 25.04.17.
 */
function handleZayavka(inputRadio) {



    var list="";
    list += "  <div class=\"input-field col s12\">";
    list += "            <select multiple>";
    list += "                <option value=\"\" disabled selected>Оберіть пункти<\/option>";
    if(inputRadio.id=='exp_zost_obl'){
        list += "                <option value=\"Устаткування, пов'язане з використанням, виготовленням, переробкою, зберіганням, транспортуванням, утилізацією чи знешкодженням небезпечних або шкідливих речовин.\">Устаткування, пов'язане з використанням, виготовленням, переробкою, зберіганням, транспортуванням, утилізацією чи знешкодженням небезпечних або шкідливих речовин.<\/option>";
        list += "                <option value=\"Технологічне устаткування та лінійні частини магістральних газопроводів, нафтопроводів, продуктопроводів (нафтопродуктопроводів, аміакопроводів, етиленопроводів тощо).\">Технологічне устаткування та лінійні частини магістральних газопроводів, нафтопроводів, продуктопроводів (нафтопродуктопроводів, аміакопроводів, етиленопроводів тощо).<\/option>"
        list += "                <option value=\"Технологічне устаткування, лінійні частини та їх елементи систем газопостачання природним і зрідженим газом суб'єктів господарювання та населених пунктів, а також газовикористовуюче обладнання потужністю понад 100 кВт.\">Технологічне устаткування, лінійні частини та їх елементи систем газопостачання природним і зрідженим газом суб'єктів господарювання та населених пунктів, а також газовикористовуюче обладнання потужністю понад 100 кВт.<\/option>"
        list += "                <option value=\"Технологічне устаткування систем промислового та міжпромислового збору нафти і газу.\">Технологічне устаткування систем промислового та міжпромислового збору нафти і газу.<\/option>"
        list += "                <option value=\"Технологічне устаткування об'єктів нафтогазовидобувної промисловості.\">Технологічне устаткування об'єктів нафтогазовидобувної промисловості.<\/option>"
        list += "                <option value=\"Технологічне устаткування для утилізації зброї, звичайних видів боєприпасів та виробів ракетної техніки.\">Технологічне устаткування для утилізації зброї, звичайних видів боєприпасів та виробів ракетної техніки.<\/option>"
        list += "                <option value=\"Гірничошахтне та гірничорятувальне устаткування.\">Гірничошахтне та гірничорятувальне устаткування.<\/option>"
        list += "                <option value=\"Устаткування для видобутку та транспортування корисних копалин відкритим способом.\">Устаткування для видобутку та транспортування корисних копалин відкритим способом.<\/option>"
        list += "                <option value=\"Конвеєрні стрічки для вугільної, гірничорудної, нерудної, металургійної та коксохімічної промисловості.\">Конвеєрні стрічки для вугільної, гірничорудної, нерудної, металургійної та коксохімічної промисловості.<\/option>"
        list += "                <option value=\"Устаткування для дроблення, сортування, збагачення корисних копалин і огрудкування руд та концентратів, технологічне обладнання з переробки природного каменю.\">Устаткування для дроблення, сортування, збагачення корисних копалин і огрудкування руд та концентратів, технологічне обладнання з переробки природного каменю.<\/option>"
        list += "                <option value=\"Устаткування та технічні засоби для виготовлення, використання і транспортування вибухових матеріалів і виробів на їх основі, комплекси для їх переробки та зберігання.\">Устаткування та технічні засоби для виготовлення, використання і транспортування вибухових матеріалів і виробів на їх основі, комплекси для їх переробки та зберігання.<\/option>"
        list += "                <option value=\"Технологічне устаткування хімічної, біохімічної, нафтохімічної, нафтогазопереробної, металургійної, коксохімічної, ливарної, олійно-жирової, ефіроолійної, деревообробної промисловості, хлор- та аміаковикористовуючих виробництв.\">Технологічне устаткування хімічної, біохімічної, нафтохімічної, нафтогазопереробної, металургійної, коксохімічної, ливарної, олійно-жирової, ефіроолійної, деревообробної промисловості, хлор- та аміаковикористовуючих виробництв.<\/option>"
        list += "                <option value=\"Технологічне устаткування для целюлозно-паперового виробництва, переробки пластмас, полімерних матеріалів і гумотехнічних виробів.\">Технологічне устаткування для целюлозно-паперового виробництва, переробки пластмас, полімерних матеріалів і гумотехнічних виробів.<\/option>"
        list += "                <option value=\"Електрообладнання, призначене для експлуатації (застосування) у вибухонебезпечних зонах.\">Електрообладнання, призначене для експлуатації (застосування) у вибухонебезпечних зонах.<\/option>"
        list += "                <option value=\"Електричне устаткування електричних станцій та мереж, технологічне електрообладнання напругою понад 1000 В.\">Електричне устаткування електричних станцій та мереж, технологічне електрообладнання напругою понад 1000 В.<\/option>"
        list += "                <option value=\"Парові і водогрійні котли теплопродуктивністю понад 0,1 МВт.\">Парові і водогрійні котли теплопродуктивністю понад 0,1 МВт.<\/option>"
        list += "                <option value=\"Посудини, що працюють під тиском понад 0,05 МПа.\">Посудини, що працюють під тиском понад 0,05 МПа.<\/option>"
        list += "                <option value=\"Трубопроводи пари та гарячої води з робочим тиском понад 0,05 МПа і температурою води вище 110 град. С, які підлягають реєстрації в територіальних органах Держпраці.\">Трубопроводи пари та гарячої води з робочим тиском понад 0,05 МПа і температурою води вище 110 град. С, які підлягають реєстрації в територіальних органах Держпраці.<\/option>"
        list += "                <option value=\"Вантажопідіймальні крани і машини, ліфти, ескалатори, траволатори, канатні дороги, підйомники, зокрема будівельні, та фунікулери.\">Вантажопідіймальні крани і машини, ліфти, ескалатори, траволатори, канатні дороги, підйомники, зокрема будівельні, та фунікулери.<\/option>"
        list += "                <option value=\"Технологічні транспортні засоби, що підлягають реєстрації в територіальних органах Держпраці.\">Технологічні транспортні засоби, що підлягають реєстрації в територіальних органах Держпраці.<\/option>"
        list += "                <option value=\"Атракціони підвищеної небезпеки стаціонарні, пересувні та мобільні.\">Атракціони підвищеної небезпеки стаціонарні, пересувні та мобільні.<\/option>"



    }
    // list += "                <option value=\"1\">Option 1<\/option>";
    // list += "                <option value=\"2\">Option 2<\/option>";
    // list += "                <option value=\"3\">Option 3<\/option>";
    list += "            <\/select>";
    list += "            <label>Materialize Multiple Select<\/label>";
    list += "        <\/div>";

    document.getElementById('zayavka_container').innerHTML = list;

    $('select').material_select();





}