/**
 * Created by NSD on 25.04.17.
 */
function handleZayavka(inputRadio) {



    var list="";
    list += "  <div class=\"input-field col s12\">";
    list += "            <select multiple>";
    list += "                <option value=\"\" disabled selected>Оберіть пункти<\/option>";
    if(inputRadio.id=='exp_zost_obl'){
        list += "                <option value=\"Устаткування, пов'язане з використанням, виготовленням, переробкою, зберіганням, транспортуванням, утилізацією чи знешкодженням небезпечних або шкідливих речовин.\">Устаткування, пов'язане з використанням, виготовленням, переробкою, зберіганням, транспортуванням, утилізацією чи знешкодженням небезпечних або шкідливих речовин.<\/option>";
        list += "                <option value=\"Технологічне устаткування та лінійні частини магістральних газопроводів, нафтопроводів, продуктопроводів (нафтопродуктопроводів, аміакопроводів, етиленопроводів тощо).\">Технологічне устаткування та лінійні частини магістральних газопроводів, нафтопроводів, продуктопроводів (нафтопродуктопроводів, аміакопроводів, етиленопроводів тощо).<\/option>"
        list += "                <option value=\"Технологічне устаткування, лінійні частини та їх елементи систем газопостачання природним і зрідженим газом суб'єктів господарювання та населених пунктів, а також газовикористовуюче обладнання потужністю понад 100 кВт.\">Технологічне устаткування, лінійні частини та їх елементи систем газопостачання природним і зрідженим газом суб'єктів господарювання та населених пунктів, а також газовикористовуюче обладнання потужністю понад 100 кВт.<\/option>"
        list += "                <option value=\"Технологічне устаткування систем промислового та міжпромислового збору нафти і газу.\">Технологічне устаткування систем промислового та міжпромислового збору нафти і газу.<\/option>"
        list += "                <option value=\"Технологічне устаткування об'єктів нафтогазовидобувної промисловості.\">Технологічне устаткування об'єктів нафтогазовидобувної промисловості.<\/option>"
        list += "                <option value=\"Технологічне устаткування для утилізації зброї, звичайних видів боєприпасів та виробів ракетної техніки.\">Технологічне устаткування для утилізації зброї, звичайних видів боєприпасів та виробів ракетної техніки.<\/option>"
        list += "                <option value=\"Гірничошахтне та гірничорятувальне устаткування.\">Гірничошахтне та гірничорятувальне устаткування.<\/option>"
        list += "                <option value=\"Устаткування для видобутку та транспортування корисних копалин відкритим способом.\">Устаткування для видобутку та транспортування корисних копалин відкритим способом.<\/option>"
        list += "                <option value=\"Конвеєрні стрічки для вугільної, гірничорудної, нерудної, металургійної та коксохімічної промисловості.\">Конвеєрні стрічки для вугільної, гірничорудної, нерудної, металургійної та коксохімічної промисловості.<\/option>"
        list += "                <option value=\"Устаткування для дроблення, сортування, збагачення корисних копалин і огрудкування руд та концентратів, технологічне обладнання з переробки природного каменю.\">Устаткування для дроблення, сортування, збагачення корисних копалин і огрудкування руд та концентратів, технологічне обладнання з переробки природного каменю.<\/option>"
        list += "                <option value=\"Устаткування та технічні засоби для виготовлення, використання і транспортування вибухових матеріалів і виробів на їх основі, комплекси для їх переробки та зберігання.\">Устаткування та технічні засоби для виготовлення, використання і транспортування вибухових матеріалів і виробів на їх основі, комплекси для їх переробки та зберігання.<\/option>"
        list += "                <option value=\"Технологічне устаткування хімічної, біохімічної, нафтохімічної, нафтогазопереробної, металургійної, коксохімічної, ливарної, олійно-жирової, ефіроолійної, деревообробної промисловості, хлор- та аміаковикористовуючих виробництв.\">Технологічне устаткування хімічної, біохімічної, нафтохімічної, нафтогазопереробної, металургійної, коксохімічної, ливарної, олійно-жирової, ефіроолійної, деревообробної промисловості, хлор- та аміаковикористовуючих виробництв.<\/option>"
        list += "                <option value=\"Технологічне устаткування для целюлозно-паперового виробництва, переробки пластмас, полімерних матеріалів і гумотехнічних виробів.\">Технологічне устаткування для целюлозно-паперового виробництва, переробки пластмас, полімерних матеріалів і гумотехнічних виробів.<\/option>"
        list += "                <option value=\"Електрообладнання, призначене для експлуатації (застосування) у вибухонебезпечних зонах.\">Електрообладнання, призначене для експлуатації (застосування) у вибухонебезпечних зонах.<\/option>"
        list += "                <option value=\"Електричне устаткування електричних станцій та мереж, технологічне електрообладнання напругою понад 1000 В.\">Електричне устаткування електричних станцій та мереж, технологічне електрообладнання напругою понад 1000 В.<\/option>"
        list += "                <option value=\"Парові і водогрійні котли теплопродуктивністю понад 0,1 МВт.\">Парові і водогрійні котли теплопродуктивністю понад 0,1 МВт.<\/option>"
        list += "                <option value=\"Посудини, що працюють під тиском понад 0,05 МПа.\">Посудини, що працюють під тиском понад 0,05 МПа.<\/option>"
        list += "                <option value=\"Трубопроводи пари та гарячої води з робочим тиском понад 0,05 МПа і температурою води вище 110 град. С, які підлягають реєстрації в територіальних органах Держпраці.\">Трубопроводи пари та гарячої води з робочим тиском понад 0,05 МПа і температурою води вище 110 град. С, які підлягають реєстрації в територіальних органах Держпраці.<\/option>"
        list += "                <option value=\"Вантажопідіймальні крани і машини, ліфти, ескалатори, траволатори, канатні дороги, підйомники, зокрема будівельні, та фунікулери.\">Вантажопідіймальні крани і машини, ліфти, ескалатори, траволатори, канатні дороги, підйомники, зокрема будівельні, та фунікулери.<\/option>"
        list += "                <option value=\"Технологічні транспортні засоби, що підлягають реєстрації в територіальних органах Держпраці.\">Технологічні транспортні засоби, що підлягають реєстрації в територіальних органах Держпраці.<\/option>"
        list += "                <option value=\"Атракціони підвищеної небезпеки стаціонарні, пересувні та мобільні.\">Атракціони підвищеної небезпеки стаціонарні, пересувні та мобільні.<\/option>"



    }

    if(inputRadio.id=='exp_zost_robotu'){

        /*

         4. Вибухові роботи та роботи, пов'язані з використанням енергії вибуху.

         5. Утилізація зброї, звичайних видів боєприпасів та виробів ракетної техніки.

         6. Газонебезпечні роботи та роботи у вибухопожежонебезпечних зонах.

         7. Переробка нафти, вуглеводневих газів і конденсату.
         8. Спорудження магістральних газопроводів, нафтопроводів і продуктопроводів (нафтопродуктопроводів, аміакопроводів, етиленопроводів тощо), систем газопостачання природним та зрідженим газом.

         9. Роботи з вироблення агломерату, коксу, розплавів чорних і кольорових металів та сплавів на основі таких металів, заготовок для прокатного виробництва, готового прокату, металевих труб і феросплавів.

         10. Буріння, експлуатація та капітальний ремонт свердловин під час геологічного вивчення і розробки родовищ корисних копалин.

         11. Зберігання балонів, контейнерів, цистерн та інших ємностей із стисненим, зрідженим, отруйним, вибухонебезпечним та інертним газом, їх заповнення, спорожнення і ремонт.


         12. Роботи в діючих електроустановках напругою понад 1000 В та в зонах дії струму високої частоти.

         13. Підземні та відкриті гірничі роботи.

         14. Маркшейдерські роботи.

         15. Роботи в колодязях, шурфах, траншеях, котлованах, бункерах, камерах, колекторах, замкнутому просторі (ємностях, боксах, топках, трубопроводах).

         16. Земляні роботи, що виконуються на глибині понад 2 метри або в зоні розташування підземних

         17. Водолазні роботи.

         18. Роботи верхолазні та скелелазні, що виконуються на висоті 5 метрів і більше над поверхнею ґрунту, з перекриття або робочого настилу, та роботи, що виконуються за допомогою підйомних і підвісних колисок, механічних підіймачів та будівельних підйомників.

         19.
         Зведення, монтаж і демонтаж будинків, споруд, зміцнення їх аварійних частин, електропрогрівання бетону та електророзморожування ґрунтів.

         20. Будівництво, ремонт, експлуатація та ліквідація підземних споруд, не пов'язаних з видобутком корисних копалин.

         21. Лісосічні роботи, трелювання, транспортування та сплав лісу.

         22. Роботи із збагачування корисних копалин.

         23. Зварювальні, газополум'яні, наплавні роботи.

         24. Обстеження, ремонт та чищення димарів, повітропроводів.

         25. Роботи із збереження та переробки зерна.

         26. Звалювання та розпилювання блоків природного каменю.

         *
        *
        *
        * */


        list += "                <option value=\"Технічний огляд, випробування, експертне обстеження, технічне діагностування машин, механізмів, устаткування підвищеної небезпеки, що зазначені у додатку 3 до Порядку видачі дозволів на виконання робіт підвищеної небезпеки та на експлуатацію (застосування) машин, механізмів, устатковання підвищеної небезпеки та пункті 1 додатку 7 до такого Порядку.\">Технічний огляд, випробування, експертне обстеження, технічне діагностування машин, механізмів, устаткування підвищеної небезпеки, що зазначені у додатку 3 до Порядку видачі дозволів на виконання робіт підвищеної небезпеки та на експлуатацію (застосування) машин, механізмів, устатковання підвищеної небезпеки та пункті 1 додатку 7 до такого Порядку.<\/option>";
        list += "                <option value=\"Монтаж, демонтаж, налагодження, ремонт, технічне обслуговування, реконструкція машин, механізмів, устаткування підвищеної небезпеки, що зазначені у додатку 3 до Порядку видачі дозволів на виконання робіт підвищеної небезпеки та на експлуатацію (застосування) машин, механізмів, устаткування підвищеної небезпеки.\"> Монтаж, демонтаж, налагодження, ремонт, технічне обслуговування, реконструкція машин, механізмів, устаткування підвищеної небезпеки, що зазначені у додатку 3 до Порядку видачі дозволів на виконання робіт підвищеної небезпеки та на експлуатацію (застосування) машин, механізмів, устаткування підвищеної небезпеки.<\/option>";
        list += "                <option value=\"Виробництво, переробка, розподіл та застосування шкідливих небезпечних речовин 1, 2 і 3 класу небезпеки, а також аміаку, водню та продуктів розділення повітря.\">Виробництво, переробка, розподіл та застосування шкідливих небезпечних речовин 1, 2 і 3 класу небезпеки, а також аміаку, водню та продуктів розділення повітря. <\/option>";
        list += "                <option value=\"Вибухові роботи та роботи, пов'язані з використанням енергії вибуху.\">Вибухові роботи та роботи, пов'язані з використанням енергії вибуху. <\/option>";
        list += "                <option value=\"Утилізація зброї, звичайних видів боєприпасів та виробів ракетної техніки.\">Утилізація зброї, звичайних видів боєприпасів та виробів ракетної техніки. <\/option>";
        list += "                <option value=\"Газонебезпечні роботи та роботи у вибухопожежонебезпечних зонах.\">Газонебезпечні роботи та роботи у вибухопожежонебезпечних зонах. <\/option>";
        list += "                <option value=\"Переробка нафти, вуглеводневих газів і конденсату.\">Переробка нафти, вуглеводневих газів і конденсату. <\/option>";
        list += "                <option value=\"Спорудження магістральних газопроводів, нафтопроводів і продуктопроводів (нафтопродуктопроводів, аміакопроводів, етиленопроводів тощо), систем газопостачання природним та зрідженим газом.\">Спорудження магістральних газопроводів, нафтопроводів і продуктопроводів (нафтопродуктопроводів, аміакопроводів, етиленопроводів тощо), систем газопостачання природним та зрідженим газом. <\/option>";
        list += "                <option value=\"Роботи з вироблення агломерату, коксу, розплавів чорних і кольорових металів та сплавів на основі таких металів, заготовок для прокатного виробництва, готового прокату, металевих труб і феросплавів.\">Роботи з вироблення агломерату, коксу, розплавів чорних і кольорових металів та сплавів на основі таких металів, заготовок для прокатного виробництва, готового прокату, металевих труб і феросплавів. <\/option>";
        list += "                <option value=\"Буріння, експлуатація та капітальний ремонт свердловин під час геологічного вивчення і розробки родовищ корисних копалин.\">Буріння, експлуатація та капітальний ремонт свердловин під час геологічного вивчення і розробки родовищ корисних копалин. <\/option>";
        list += "                <option value=\"Зберігання балонів, контейнерів, цистерн та інших ємностей із стисненим, зрідженим, отруйним, вибухонебезпечним та інертним газом, їх заповнення, спорожнення і ремонт.\">Зберігання балонів, контейнерів, цистерн та інших ємностей із стисненим, зрідженим, отруйним, вибухонебезпечним та інертним газом, їх заповнення, спорожнення і ремонт. <\/option>";
        list += "                <option value=\"Роботи в діючих електроустановках напругою понад 1000 В та в зонах дії струму високої частоти.\">Роботи в діючих електроустановках напругою понад 1000 В та в зонах дії струму високої частоти. <\/option>";
        list += "                <option value=\"Підземні та відкриті гірничі роботи.\">Підземні та відкриті гірничі роботи. <\/option>";
        list += "                <option value=\"Маркшейдерські роботи.\">Маркшейдерські роботи.<\/option>";
        list += "                <option value=\"Роботи в колодязях, шурфах, траншеях, котлованах, бункерах, камерах, колекторах, замкнутому просторі (ємностях, боксах, топках, трубопроводах).\">Роботи в колодязях, шурфах, траншеях, котлованах, бункерах, камерах, колекторах, замкнутому просторі (ємностях, боксах, топках, трубопроводах). <\/option>";
        list += "                <option value=\"Земляні роботи, що виконуються на глибині понад 2 метри або в зоні розташування підземних\">Земляні роботи, що виконуються на глибині понад 2 метри або в зоні розташування підземних <\/option>";
        list += "                <option value=\"Водолазні роботи.\">Водолазні роботи. <\/option>";
        list += "                <option value=\"Роботи верхолазні та скелелазні, що виконуються на висоті 5 метрів і більше над поверхнею ґрунту, з перекриття або робочого настилу, та роботи, що виконуються за допомогою підйомних і підвісних колисок, механічних підіймачів та будівельних підйомників.\">Роботи верхолазні та скелелазні, що виконуються на висоті 5 метрів і більше над поверхнею ґрунту, з перекриття або робочого настилу, та роботи, що виконуються за допомогою підйомних і підвісних колисок, механічних підіймачів та будівельних підйомників. <\/option>";
        list += "                <option value=\"Зведення, монтаж і демонтаж будинків, споруд, зміцнення їх аварійних частин, електропрогрівання бетону та електророзморожування ґрунтів.\">Зведення, монтаж і демонтаж будинків, споруд, зміцнення їх аварійних частин, електропрогрівання бетону та електророзморожування ґрунтів. <\/option>";
        list += "                <option value=\"Будівництво, ремонт, експлуатація та ліквідація підземних споруд, не пов'язаних з видобутком корисних копалин.\">Будівництво, ремонт, експлуатація та ліквідація підземних споруд, не пов'язаних з видобутком корисних копалин. <\/option>";
        list += "                <option value=\"Лісосічні роботи, трелювання, транспортування та сплав лісу.\"> Лісосічні роботи, трелювання, транспортування та сплав лісу. <\/option>";
        list += "                <option value=\"Роботи із збагачування корисних копалин.\">Роботи із збагачування корисних копалин. <\/option>";
        list += "                <option value=\"Зварювальні, газополум'яні, наплавні роботи.\">Зварювальні, газополум'яні, наплавні роботи. <\/option>";
        list += "                <option value=\"Обстеження, ремонт та чищення димарів, повітропроводів.\">Обстеження, ремонт та чищення димарів, повітропроводів. <\/option>";
        list += "                <option value=\"Роботи із збереження та переробки зерна.\"><\/option>";
        list += "                <option value=\" Звалювання та розпилювання блоків природного каменю.\"> Звалювання та розпилювання блоків природного каменю. <\/option>";
    }


    // list += "                <option value=\"1\">Option 1<\/option>";
    // list += "                <option value=\"2\">Option 2<\/option>";
    // list += "                <option value=\"3\">Option 3<\/option>";
    list += "            <\/select>";
    list += "            <label>Materialize Multiple Select<\/label>";
    list += "        <\/div>";

    document.getElementById('zayavka_container').innerHTML = list;

    $('select').material_select();
    $('#zayavka_dialog').scrollTo('select');




}